# 1. Создайте файл math_utils.py,
# добавьте в него функцию для расчёта факториала.
# 2. В main.py импортируйте math_utils и вызовите вашу функцию.

import my_module

print(my_module.factorial)

print(f'Факториал =, {x}')
#print(my_module.PI)